Tekla Open API Reference for Tekla Structures 2025
AnalysisModelSpectrumProperties.SpectrumModeCount Property
 The count of the spectrum mode.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int SpectrumModeCount { get; set; }
Public Property SpectrumModeCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnalysisModelSpectrumProperties Class
Tekla.Structures.Analysis Namespace